/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIProgressDialogText" = "Kirjaudutaan";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIAlertViewButtonText" = "OK";

/* XHED: label for a field max. 60 chars */
"keyMAFLogonUIAlertViewTitle" = "Virhe";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelServerHost" = "Palvelin";

/* XFLD: label for a field max. 60 chars */
"keyMAFLogonUIFieldLabelResourcePath" = "URL-loppuliite";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelServerPort" = "Portti";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelServerDomain" = "Alue";

/* XFLD: label for a switch (on/off), max 60 chars */
"keyMAFLogonUIFieldLabelIsHttps" = "Suojattu kanava";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelBackendPassword" = "Salasana";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelBackendPasswordAgain" = "Vahvista salasana";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelFarmId" = "Farm-ID";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelSecurityConfig" = "Suojauskonfiguraatio";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelBackendUserName" = "Käyttäjänimi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelSecureStorePassword" = "Uusi pääsykoodi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelCreateSecureStorePassword" = "Pääsykoodi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelSecureStorePasswordAgain" = "Vahvista pääsykoodi";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordCurrent" = "Nykyinen sov. pääsykoodi";

/* XGRP: label for a group of fields max. 60 chars */
"keyMAFLogonUIFieldLabelSecureStorePasswordOldWhenToogle" = "Sovelluksen pääsykoodi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelMobileUser" = "Mobiilikäyttäjä";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelActivationCode" = "Aktivointikoodi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelGatewayClient" = "Asiakas";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSSOPasscode" = "SSO-pääsykoodi";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelAfariaUserName" = "Käyttäjänimi";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelAfariaPassword" = "Salasana";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSSOPassword" = "Salasana";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelUserName" = "Käyttäjänimi";

/* XFLD: label for a field max. 60 chars */
"keyMAFLogonUIFieldHintOptional" = "(Valinnainen)";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelDeleteUser" = "Haluatko poistaa sovelluksen aktivoinnin?";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelLock" = "Haluatko lukita sovelluksen?";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelUpdateApplicationSettings" = "Haluatko päivittää sovelluksen asetukset?";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIFieldLabelServerTrust" = "Luotatko tähän varmenteeseen?";

/* XFLD: label for a field max. 60 chars */
"keyMAFLogonUIFieldLabelUploadTrace" = "Haluatko ladata jäljitykset palvelimeen?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelTurnPasscodeOn" = "Aktivoi pääsykoodi";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelTurnPasscodeOff" = "Poista pääsykoodin aktivointi";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelChangePasscode" = "Muuta pääsykoodia";

/* XGRP: label for a group of fields max. 60 chars */
"keyMAFLogonUIGroupTextForBasicRegistrationGroup" = "Kirjautumistiedot";

/* XGRP: label for a group of fields max. 60 chars */
"keyMAFLogonUIGroupTextForHiddenGroupBasic" = "Lisätiedot";

/* XGRP: label for a group of fields max. 60 chars */
"keyMAFLogonUIGroupTextForPasswordCreation" = "Sovelluksen pääsykoodi";

/* XGRP: label for a group of fields max. 60 chars */
"keyMAFLogonUIGroupTextForPasswordChangeNewGroup" = "Sovelluksen pääsykoodi";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelRegistrationStart" = "Seuraava";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelStartLogon" = "Kirjaudu";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelDemoMode" = "Kokeile";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelRegistrationCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelSecureStoreCreationStart" = "Valmis";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelSecureStoreCreationCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUnlockStart" = "Kirjaudu";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUnlockCancel" = "Unohditko salasanan?";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelLockStart" = "Lukitse";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelLockCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUpdateApplicationSettingsStart" = "Päivitä";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUpdateApplicationSettingsCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelDeleteStart" = "Poista aktivointi";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelDeleteCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelChangeSecureStorePasswordStart" = "Valmis";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelChangeSecureStorePasswordCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelChangeBackendPasswordStart" = "Valmis";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelChangeBackendPasswordCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelRegistrationInfoCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUploadTraceStart" = "Lataa";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOForgot" = "SSO-pääsykoodi unohtunut";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOSkip" = "Ohita";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterAfariaStart" = "Valmis";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterAfariaCancel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIActionItemLabelUploadTraceCancel" = "Peruuta";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOStart" = "Seuraava";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterCredentialsStart" = "Seuraava";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterCredentialsCancel" = "Peruuta";

/* XBUT */
"keyMAFLogonUIActionItemLabelPasscodeLockCancel" = "Paluu";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOCancel" = "Peruuta";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelRegistrationScreen" = "Kirjaudu";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelSSOPasscodeScreen" = "Syötä SSO-pääsykoodi";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelPasscodeLockScreen" = "Pääsykoodilukitus";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelEnterCredentialsScreen" = "Syötä kirjautumistiedot";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelAfariCredentialsScreen" = "Afaria";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelEnterPasscodeScreen" = "Syötä pääsykoodi";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelSecureStoreCreationScreen" = "Aseta pääsykoodi";

/* XHED: label for a group of fields max. 60 chars */
"keyMAFLogonUIViewTitleLabelChangeSecureStorePasswordScreen" = "Muuta pääsykoodia";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelUnlockScreen" = "Kirjaudu";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelDeleteScreen" = "Poista";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelLockScreen" = "Lukitse";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelUpdateScreen" = "Päivitä";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelUploadTraceScreen" = "Lataa jäljitys";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelChangeBackendPasswordScreen" = "Päivitä salasana";

/* XHED max. 60 chars */
"keyMAFLogonUIViewTitleLabelRegistrationInfoScreen" = "Kirjautumistiedot";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelRegistrationScreen" = "Kirjaudu";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationScreen" = "Aseta pääsykoodi.";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationOptionalScreen" = "Aseta pääsykoodi";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelEnterSSOScreen" = "Syötä SSO-salasana";

/* XHED */
"keyMAFLogonUIHeaderTitleabelEnterAfariaScreen" = "Afaria";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleabelEnterCredentialsScreen" = "Syötä kirjautumistiedot";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationOptionalInRegistrationScreen" = "Aseta pääsykoodi";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelChangeSecureStorePasswordScreen" = "Muuta pääsykoodia";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelChangeSecureStorePasswordOptionalScreen" = "Muuta pääsykoodia";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelDeleteSecureStorePasswordScreen" = "Poista pääsykoodi käytöstä";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelUnlockScreen" = "Kirjaudu";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelDeleteScreen" = "Poista";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelLockScreen" = "Lukitse";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelUpdateScreen" = "Päivitä";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelUploadTraceScreen" = "Lataa jäljitys";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelChangeBackendPasswordScreen" = "Päivitä salasana";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelRegistrationInfoScreen" = "Kirjautumistiedot";

/* XHED max. 60 chars */
"keyMAFLogonUIHeaderTitleLabelSplashScreen" = "SAP MAF:n kirjautumisesimerkki";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelSplashScreen" = "Jos sinulla ei ole omia kirjautumistietoja, voit kokeilla sovellusta esimerkkitietoja käyttäen.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelRegistrationScreen" = "Syötä kirjautumistietosi sovellukseen kirjautumista varten. Sovellus muistaa nämä tiedot.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationScreen" = "Sinun täytyy asettaa sovelluksen pääsykoodi sovelluksen suojaamiseksi luvattomalta käytöltä.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationOptionalScreen" = "Voit asettaa sovelluksen pääsykoodin sovelluksen suojaamiseksi luvattomalta käytöltä.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationOptionalInRegistrationScreen" = "Voit asettaa sovelluksen pääsykoodin sovelluksen suojaamiseksi luvattomalta käytöltä.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelChangeSecureStorePasswordScreen" = "Syötä ensin vanha ja sen jälkeen uusi sovelluksen pääsykoodi pääsykoodin muuttamista varten.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelChangeSecureStorePasswordOptionalScreen" = "Syötä ensin vanha ja sen jälkeen uusi sovelluksen pääsykoodi pääsykoodin muuttamista varten.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelDeleteSecureStorePasswordScreen" = "Syötä sovelluksen pääsykoodi sen käytöstä poistamista varten.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelUnlockScreen" = "Syötä sovelluksen pääsykoodi sovellukseen kirjautumista varten.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelDeleteScreen" = "Tämä on esimerkki kirjautumisjärjestyksen kontekstikohtaisesta menettelytavasta MAF-kompontteja käyttäen - Poista";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelLockScreen" = "Tämä on esimerkki kirjautumisjärjestyksen kontekstikohtaisesta menettelytavasta MAF-kompontteja käyttäen - Lukitse";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelUpdateScreen" = "Tämä on esimerkki kirjautumisjärjestyksen kontekstikohtaisesta menettelytavasta MAF-kompontteja käyttäen - Päivitä";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelUploadTraceScreen" = "Tämä on esimerkki kirjautumisjärjestyksen kontekstikohtaisesta menettelytavasta MAF-kompontteja käyttäen - Lataa jäljitys";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelChangeBackendPasswordScreen" = "Syötä nykyinen salasanasi sovellukselle käytettävän salasanan päivitystä varten.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIHeaderDescriptionLabelRegistrationInfoScreen" = "Voit näyttää kirjautumistietosi sovellusta varten.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterSSOScreen" = "Syötä salasana Client Hubin käyttöä varten.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterAfariaScreen" = "Syötä Afaria-kirjautumistietosi.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterCredentialsScreen" = "Syötä kirjautumistietosi sovellukseen kirjautumista varten. Client Hub -sovellus tallentaa nämä kirjautumistiedot, ja voit käyttää niitä myös muissa sovelluksissa.";

/* XMSG: message max. 150 chars */
"keyMAFLogonUIConfirmationMessage" = "Haluatko varmasti palauttaa sovelluksen?";

/* XHED: message max. 60 chars */
"keyMAFLogonUIConfirmationTitle" = "Vahvistus";

/* XBUT max. 60 chars */
"keyMAFLogonUIConfirmationCancelButtonLabel" = "Peruuta";

/* XBUT max. 60 chars */
"keyMAFLogonUIConfirmationOKButtonLabel" = "OK";

/* XMSG: message max. 60 chars */
"keyMAFLogonUIFooterDescriptionLabel" = "2014 SAP SE";

/* XGRP max. 60 chars */
"keyMAFLogonUIGroupTextForPasswordChangeGroupTitlePasscodeMandatory" = "Muuta sovelluksen pääsykoodia";

/* XGRP max. 60 chars */
"keyMAFLogonUIGroupTextForPasswordChangeGroupTitleDefPasscodeUsed" = "Aseta sovelluksen pääsykoodi";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIDeleteProgressDialogText" = "Poistetaan";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIUpdateApplicationSettingsProgressDialogText" = "Päivitetään";

/* XFLD: label for a field  max. 60 chars */
"keyMAFLogonUIUploadTraceProgressDialogText" = "Ladataan";

/* XMSG: message max. 60 chars */
"keyErrMAFLogonUINGRegistrationCancelled" = "Rekisteröinti peruutettu.";

/* XMSG: message max. 60 chars */
"keyErrMAFLogonUINGOperationCancelled" = "Tapahtuma peruutettu.";

/* XMSG: message max. 60 chars */
"keyErrMAFLogonUINGPasscodeChangeNotAllowed" = "Afarian pääsykoodikäytäntö on \"aina pois käytöstä\", pääsykood. ei voi muuttaa.";

/* XMSG: message */
"keyErrDescrMAFLogonManagerErrorPasswordsNotEqual" = "Syöttämäsi pääsykoodit eivät täsmää.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonUINGErrorPasswordsNotEqual" = "Syöttämäsi pääsykoodit eivät täsmää.";

/* XHED: message */
"keyMAFLogonUIConfirmationEnterSSOAlertViewTitle" = "SSO-pääsykoodi unohtunut";

/* XMSG: message */
"keyMAFLogonUIConfirmationEnterSSOAlertViewMessage" = "Palauta SSO-pääsykoodi Client Hubissa ja käynnistä sovellus uudelleen.";

/* XMSG: message */
"keyMAFLogonUIConfirmationEnterSSORelaunchSkipAlertViewMessage" = "SSO-merkinnän ohittaminen irrottaa tämän sovelluksen Client Hubista.";

/* XMSG: message */
"keyErrDescrMAFLogonUINGMCIMSSOPinInvalid" = "Virheellinen SSO-pääsykoodi";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Tapahtuma ei ole sallittu tässä tilassa.";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordOld" = "Vanha pääsykoodi";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present information about the currently set timeout for the App Passcode. */
"keyMAFLogonUIFieldLabelApplicationTimeout" = "Aikakatkaisu";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. */
"keyMAFLogonUIFieldLabelTimeoutImmediately" = "Heti";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingleSecond" = "%1$i sekunnin kuluttua.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlularSecond" = "%1$i sekunnin kuluttua.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingle" = "%1$i minuutin kuluttua.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlular" = "%1$i minuutin kuluttua.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingleHour" = "%1$i tunnin kuluttua.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlularHour" = "%1$i tunnin kuluttua.";

